/*
对用户输入的身份证号进行校验。
Input
18位身份证号，其中若包含X，保证输入为大写字母。
Output
若身份证号校验合法，输出 `OK` 字样；否则输出 `ERROR` 字样。
公民身份号码共 18 位，第 18 位为校验位。

1. 将第 1～17 位按以下权重值【7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2】依次相乘，并累加；

2. 将累加结果对 11 取余数；

3. 取余结果为 0～10，对应的公民身份号码第 18 位应为 【1,0,X,9,8,7,6,5,4,3,2】。
*/




#include<stdio.h>
int main()
{
	char id[18];
	int sum=0,i;
	int a[17]={7,9,10,5,8,4,2,1,6,3,7,9,10,5,8,4,2};
	char b[11]={'1','0','X','9','8','7','6','5','4','3','2'};
	for(i=0;i<17;i++)
	{
		scanf("%s",&id[i]);
		sum+=(id[i]-48)*a[i];
	}
	if(b[sum%11]==id[17])
	{
		printf("OK");		
	}else
	{
		printf("ERROR");
	}
	return 0;	
}